package School;

import java.util.Random;

public class RandomNameTeachers {
    public static String random1() {
        String[] choice = { "Яковлева Мария Максимовна",
                "Михайлова Ева Макаровна",
                "Борисов Максим Михайлович",
                "Снегирев Евгений Кириллович",
                "Пастухова Елизавета Ивановна",
                "Зайцев Тимур Егорович",
                "Калашникова Варвара Максимовна",
                "Антонова Александра Викторовна",
                "Бородин Леонид Ярославович",
                "Колесникова София Николаевна",
                "Колесников Иван Ильич",
                "Семенов Егор Маркович",
                "Большаков Василий Александрович",
                "Терентьев Никита Макарович",
                "Щукин Семён Сергеевич",
                "Гришин Иван Александрович",
                "Суханова Валерия Саввична",
                "Николаева Анна Александровна",
                "Самсонова Виктория Артёмовна",
                "Фролова Александра Михайловна",
                "Анисимова Елена Дмитриевна",
                "Грачев Валерий Давидович",
                "Карпова Алсу Елисеевна",
                "Жукова Амина Никитична",
                "Миронов Иван Арсентьевич"};
        Random random = new Random();
        int n = (int) (Math.random()* choice.length);
        return choice[n];
    }

    public static String random2() {
        String[] choice ={ "математика",
                "история",
                "русский язык",
                "информатика",
                "белоруская литература",
                "русская литература",
                "изо",
                "английский",
                "физика",
                "химия",
                "физкультура",
                "география"};
        Random random = new Random();
        int n = (int) (Math.random()* choice.length);
        return choice[n];
    }

    public static String random3() {
        String[] choice = {"Начинающий специалист", "Преподаватель 1-ой категории", "Преподаватель 2-ой категории", "Преподаватель высшей категории"};
        Random random = new Random();
        int n = (int) (Math.random()* choice.length);
        return choice[n];
    }

    public static int random4(int min, int max) {
        max -= min;
        return (int) (Math.random() * ++max) + min;
    }

}
